# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление. Числа запрашивать у пользователя
# , предусмотреть обработку ситуации деления на ноль.

# def my_func(arg1, arg2):
#     try:
#         res = arg1 / arg2
#         return res
#     except ZeroDivisionError:
#         return "arg2 не может быть равен нулю"
#     except ValueError:
#         return "Неправильный делитель! Вы не можете использовать ноль в качестве делителя"
#
# print(my_func(int(input("Ввведите, пожалуйста, делимое: ")), int(input("Ввведите, пожалуйста, делитель:  "))))


# 2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя: имя, фамилия, год рождения, город проживания,
# email, телефон. Функция должна принимать параметры как именованные аргументы. Реализовать вывод данных о пользователе одной строкой.
#
# def my_func(name, surname, byear, city, email, phone):
#     print(name, surname, byear, city, email, phone)
# my_func(name= 'Natalya', surname='Talyanova', byear=1978, city='Nsk', email='@mail', phone='8913')

# 3. Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.

# def my_func(x, y, z):
#     s_arg = [x, y, z]
#     total = []
#     max_1 = max(s_arg)
#     total.append(max_1)
#     s_arg.remove(max_1)
#     max_2 = max(s_arg)
#     total.append(max_2)
#     print(sum(total))
#
# print(f'Result - {my_func(int(input("Ведите первый аргумент: ")),int(input("Ведите второй аргумент: ")),int(input("Ведите третий аргумент: ")))}')


# 4. Программа принимает действительное положительное число x и целое отрицательное число y. Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y). При решении задания необходимо обойтись без встроенной функции возведения числа
# в степень.
# ** Подсказка:** попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.


# def my_func(x, y):
#     return 1 / x ** abs(y)
#     #return x ** y
# print(my_func(2, -4))

# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме. Но если вместо числа вводится специальный символ,
# выполнение программы завершается. Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму
# этих чисел к полученной ранее сумме и после этого завершить программу.
# def my_sum():
#     sum_res = 0
#     ex = False
#     while ex == False:
#         try:
#             number = input('Введите строку чисел, разделенных пробелом - ').split()
#         except ValueError:
#             return
#         res = 0
#         for el in range(len(number)):
#             if number[el] == 'q' or number[el] == 'Q':
#                 ex = True
#                 break
#             else:
#                 try:
#                  res = res + int(number[el])
#                 except ValueError:
#                     return
#         sum_res = sum_res + res
#         print(f'Текущая сумма чисел равна {sum_res}')
#     print(f'Ваша окончательная сумма {sum_res}')
#
# my_sum()

# 6. Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же, но с прописной первой буквой.
# Например, print(int_func(‘text’)) -> Text.
# Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом. Каждое слово состоит из латинских
# букв в нижнем регистре. Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы. Необходимо использовать
# написанную ранее функцию int_func().

# def int_func (*args):
#     word = input("Введите слово ")
#     print(word.title())
#     return
# int_func()

# def my_func(a):
#     s_word = a.split(' ')
#     total = []
#     for i in s_word:
#         string_element = str(i)
#         first_letter = string_element[:1].upper()
#         word = first_letter + string_element[1:]
#         total.append(word)
#     return total
# print(my_func(input("Введите слова на латинском через пробел с маленькой буквы: ")))
